In [1]:
import pandas as pd

In [2]:
movies = ['Avengers','Baahubali','Iron man','Superman','Batman','Thor']
s = pd.Series(movies)

In [3]:
s

0     Avengers
1    Baahubali
2     Iron man
3     Superman
4       Batman
5         Thor
dtype: object

In [4]:
s[1]

'Baahubali'

In [5]:
s[0:3]

0     Avengers
1    Baahubali
2     Iron man
dtype: object

In [6]:
s.sort_values()

0     Avengers
1    Baahubali
4       Batman
2     Iron man
3     Superman
5         Thor
dtype: object

In [7]:
dataset = {
    "movie_name" : ['Avengers','Baahubali','Iron man','Superman',
                    'Batman','Thor','Hulk','Saw','300','The ring'],
    "movie_ratings" : [5,5,4,4,5,4,3,4,5,3]
}

In [8]:
df = pd.DataFrame(dataset)

In [9]:
df

  movie_name  movie_ratings
0   Avengers              5
1  Baahubali              5
2   Iron man              4
3   Superman              4
4     Batman              5
5       Thor              4
6       Hulk              3
7        Saw              4
8        300              5
9   The ring              3

In [10]:
df.shape

(10, 2)

In [11]:
# will show top 5 observations
df.head()

  movie_name  movie_ratings
0   Avengers              5
1  Baahubali              5
2   Iron man              4
3   Superman              4
4     Batman              5

In [12]:
df.tail()

  movie_name  movie_ratings
5       Thor              4
6       Hulk              3
7        Saw              4
8        300              5
9   The ring              3

In [15]:
df.sort_values('movie_ratings', ascending=False)

  movie_name  movie_ratings
0   Avengers              5
1  Baahubali              5
4     Batman              5
8        300              5
2   Iron man              4
3   Superman              4
5       Thor              4
7        Saw              4
6       Hulk              3
9   The ring              3

In [17]:
df['movie_name']

0     Avengers
1    Baahubali
2     Iron man
3     Superman
4       Batman
5         Thor
6         Hulk
7          Saw
8          300
9     The ring
Name: movie_name, dtype: object

In [18]:
df[0:4]

  movie_name  movie_ratings
0   Avengers              5
1  Baahubali              5
2   Iron man              4
3   Superman              4

In [20]:
df[df['movie_ratings'] == 5]

  movie_name  movie_ratings
0   Avengers              5
1  Baahubali              5
4     Batman              5
8        300              5

In [22]:
df[(df['movie_ratings'] == 5) & (df['movie_name'] == 'Avengers')]

  movie_name  movie_ratings
0   Avengers              5